from convertor import get_quotes

cbr_currencies = {}
cbr_xml = get_quotes()
y = 0

currencies_list = ['Австралийский доллар', 'Азербайджанский манат', 'Фунт стерлингов', 'Армянский драм',
                   'Белорусский рубль', 'Болгарский лев', 'Бразильский реал', 'Венгерский форинт', 'Гонконгский доллар',
                   'Датская крона', 'Доллар США', 'Евро', 'Индийский рупий', 'Казахстанская тенге', 'Канадский доллар',
                   'Киргизский сом', 'Китайский юань', 'Молдавский лей', 'Норвежская крона', 'Польский злотый',
                   'Румынский лей', 'Российский рубль', 'Сингапурский доллар', 'Таджикская сомони', 'Турецкая лира',
                   'Новый туркменский манат', 'Узбекская сума', 'Украинская гривна', 'Чешская крона', 'Шведская крона',
                   'Швейцарский франк', 'Южноафриканская рэнда', 'Вон Республики Корея', 'Японская иена']

for i in cbr_xml.find_all('Valute'):
    cbr_currencies[currencies_list[y]] = i.NumCode.string
    if y != len(currencies_list) - 1:
        y += 1

cbr_currencies['Российский рубль'] = '000'


def get_cbr_currencies():
    return cbr_currencies


def get_currencies_list():
    return currencies_list
